#Использовать asserts
#Использовать tempfiles

#Использовать ".."

Перем мМенеджерВременныхФайлов;

Функция ПолучитьСписокТестов(Знач ЮнитТестирование) Экспорт

	МассивТестов = Новый Массив;
	МассивТестов.Добавить("Тест_ОтносительныйПуть");
	МассивТестов.Добавить("Тест_ОтносительныйПуть_ДругойСлеш");
	МассивТестов.Добавить("Тест_ОтносительныйПуть_НеСвязанныеПути");
	МассивТестов.Добавить("Тест_ОтносительныйПуть_РазныеСлешиВКорнеИПути");
	МассивТестов.Добавить("Тест_ОтносительныйПуть_ВернутьТочкуДляТекущегоКаталога");
	МассивТестов.Добавить("Тест_ОтносительныйПуть_РазныеРегистры");

	МассивТестов.Добавить("Тест_ПолныйПуть");

	Возврат МассивТестов;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура Тест_ОтносительныйПуть() Экспорт
	Путь = "d:\build";
	Корень = "d:\";

	ОтносительныйПуть = ФС.ОтносительныйПуть(Корень, Путь);
	Ожидаем.Что(ОтносительныйПуть).Равно("build");

КонецПроцедуры

Процедура Тест_ОтносительныйПуть_ДругойСлеш() Экспорт
	Путь = "d:/build";
	Корень = "d:/";

	ОтносительныйПуть = ФС.ОтносительныйПуть(Корень, Путь);
	Ожидаем.Что(ОтносительныйПуть).Равно("build");

КонецПроцедуры

Процедура Тест_ОтносительныйПуть_НеСвязанныеПути() Экспорт
	Путь = "d:\build";
	Корень = "w:\";

	ОтносительныйПуть = ФС.ОтносительныйПуть(Корень, Путь);
	Ожидаем.Что(ОтносительныйПуть).Равно(Путь);

КонецПроцедуры

Процедура Тест_ОтносительныйПуть_РазныеСлешиВКорнеИПути() Экспорт
	Путь = "d:\build/path";
	Корень = "d:/";

	ОтносительныйПуть = ФС.ОтносительныйПуть(Корень, Путь, ПолучитьРазделительПути());

	Рез = СтрШаблон("build%1path", ПолучитьРазделительПути());
	Ожидаем.Что(ОтносительныйПуть).Равно(Рез);

КонецПроцедуры

Процедура Тест_ОтносительныйПуть_ВернутьТочкуДляТекущегоКаталога() Экспорт
	Путь = "d:\build";
	Корень = "d:\build";

	ОтносительныйПуть = ФС.ОтносительныйПуть(Корень, Путь);
	Ожидаем.Что(ОтносительныйПуть).Равно(".");
КонецПроцедуры

Процедура Тест_ОтносительныйПуть_РазныеРегистры() Экспорт
	Путь = "c:\j\workspace\p-U4K64BCDKA@2\epf";
	Корень = "C:\j\WORKSPACE\p-U4K64BCDKA@2";

	ОтносительныйПуть = ФС.ОтносительныйПуть(Корень, Путь);
	Ожидаем.Что(ОтносительныйПуть).Равно("epf");
КонецПроцедуры

Процедура Тест_ПолныйПуть() Экспорт
	Путь = "C:\projects\SB\vanessa\.\\apache";

	ПолныйПуть = ФС.ПолныйПуть(Путь);
	Ожидаем.Что(ПолныйПуть).Равно("C:\projects\SB\vanessa\apache");
КонецПроцедуры
