
#Использовать asserts
#Использовать tempfiles

Перем лФС;

&Перед
Процедура ПередЗапускомТеста() Экспорт
	Путь = ТекущийСценарий().Каталог + "/../Модули/ФС.os";
	лФС = ЗагрузитьСценарий(Путь);
КонецПроцедуры

&Тест
Процедура Тест_ОтносительныйПуть() Экспорт
	Путь = "d:\build";
	Корень = "d:\";

	ОтносительныйПуть = лФС.ОтносительныйПуть(Корень, Путь);
	Ожидаем.Что(ОтносительныйПуть).Равно("build");

КонецПроцедуры

&Тест
Процедура Тест_ОтносительныйПуть_ДругойСлеш() Экспорт
	Путь = "d:/build";
	Корень = "d:/";

	ОтносительныйПуть = лФС.ОтносительныйПуть(Корень, Путь);
	Ожидаем.Что(ОтносительныйПуть).Равно("build");

КонецПроцедуры

&Тест
Процедура Тест_ОтносительныйПуть_НеСвязанныеПути() Экспорт
	Путь = "d:\build";
	Корень = "w:\";

	ОтносительныйПуть = лФС.ОтносительныйПуть(Корень, Путь);
	Ожидаем.Что(ОтносительныйПуть).Равно(Путь);

КонецПроцедуры

&Тест
Процедура Тест_ОтносительныйПуть_РазныеСлешиВКорнеИПути() Экспорт
	Путь = "d:\build/path";
	Корень = "d:/";

	ОтносительныйПуть = лФС.ОтносительныйПуть(Корень, Путь, ПолучитьРазделительПути());

	Рез = СтрШаблон("build%1path", ПолучитьРазделительПути());
	Ожидаем.Что(ОтносительныйПуть).Равно(Рез);

КонецПроцедуры

&Тест
Процедура Тест_ОтносительныйПуть_ВернутьТочкуДляТекущегоКаталога() Экспорт
	Путь = "d:\build";
	Корень = "d:\build";

	ОтносительныйПуть = лФС.ОтносительныйПуть(Корень, Путь);
	Ожидаем.Что(ОтносительныйПуть).Равно(".");
КонецПроцедуры

&Тест
Процедура Тест_ОтносительныйПуть_РазныеРегистры() Экспорт
	Путь = "c:\j\workspace\p-U4K64BCDKA@2\epf";
	Корень = "C:\j\WORKSPACE\p-U4K64BCDKA@2";

	ОтносительныйПуть = лФС.ОтносительныйПуть(Корень, Путь);
	Ожидаем.Что(ОтносительныйПуть).Равно("epf");
КонецПроцедуры

&Тест
Процедура Тест_ПолныйПуть() Экспорт
	Путь = "C:\projects\SB\vanessa\.\\apache";

	ПолныйПуть = лФС.ПолныйПуть(Путь);
	Ожидаем.Что(ПолныйПуть).Равно("C:\projects\SB\vanessa\apache");
КонецПроцедуры

&Тест
Процедура Тест_ОбъединитьПутиПравильно() Экспорт

	ПолныйПуть = лФС.ОбъединитьПути("E:\my\test", "\images", "upload/pic.png");

	ПолныйПуть = СтрЗаменить(ПолныйПуть, ПолучитьРазделительПути(), "\");

	Ожидаем.Что(ПолныйПуть).Равно("E:\my\test\images\upload\pic.png");
	
КонецПроцедуры

&Тест
&Параметры("C:\projects\SB\vanessa\.\\apache", "C:\projects\SB\vanessa\apache")
Процедура Тест_ПутиРавны(Первый, Второй) Экспорт
	Ожидаем.Что(лФС.ПутиРавны(Первый, Второй)).ЭтоИстина();
КонецПроцедуры
