#Использовать asserts
#Использовать tempfiles

#Использовать ".."

Перем мМенеджерВременныхФайлов;

Функция ПолучитьСписокТестов(Знач ЮнитТестирование) Экспорт

	МассивТестов = Новый Массив;
	МассивТестов.Добавить("Тест_ПроверитьХешСумму");
	МассивТестов.Добавить("Тест_ФайлыРавны");
	МассивТестов.Добавить("Тест_ФайлыНеРавны");

	Возврат МассивТестов;

КонецФункции

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры


Процедура Тест_ПроверитьХешСумму() Экспорт
	
	ХешьСуммаSHA1 = "01b307acba4f54f55aafc33bb06bbbf6ca803e9a";

	ПутьКФайлу = ОбъединитьПути(ТекущийКаталог(), "tests", "resources", "ValidSum.txt");
	Ожидаем.Что(ФС.ПолучитьСуммуФайлаSHA1(ПутьКФайлу)).Равно(ХешьСуммаSHA1);

КонецПроцедуры

Процедура Тест_ФайлыРавны() Экспорт
	ПервыйФайл = ОбъединитьПути(ТекущийКаталог(), "tests", "resources", "ValidSum.txt"); 
	ВторойФайл = ОбъединитьПути(ТекущийКаталог(), "tests", "resources", "ValidSum2.txt");
	Ожидаем.Что(ФС.СравнитьФайлы(ПервыйФайл, ВторойФайл)).Равно(Истина);
КонецПроцедуры

Процедура Тест_ФайлыНеРавны() Экспорт
	ПервыйФайл = ОбъединитьПути(ТекущийКаталог(), "tests", "resources", "ValidSum.txt"); 
	ВторойФайл = ОбъединитьПути(ТекущийКаталог(), "tests", "resources", "NoValidSum.txt");
	Ожидаем.Что(ФС.СравнитьФайлы(ПервыйФайл, ВторойФайл)).Равно(Ложь);
КонецПроцедуры